tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
/*
 * Tiku Operating System v0.04
 * Simple. Ubiquitous. Intelligence, Everywhere.
 * http://tiku-os.org
 *
 * Authors: Jeremy Goh
 *
 * tiku_stm32f411_regs.h - STM32F411RE register definitions
 *
 * Just enough peripheral register addresses, bitfield masks, IRQ numbers,
 * and small helpers to bring the kernel up bare-metal without pulling in
 * STM32Cube or CMSIS device headers.
 *
 * Source: ST RM0383, STM32F411xC/E advanced Arm-based 32-bit MCUs,
 *         Rev 4. Peripheral boundaries are from the memory map; interrupt
 *         numbers mirror Table 37.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef TIKU_STM32F411_REGS_H_
#define TIKU_STM32F411_REGS_H_

#include <stdint.h>

/*---------------------------------------------------------------------------*/
/* HELPERS                                                                   */
/*---------------------------------------------------------------------------*/

#define _STM32F411_REG(addr)        (*(volatile uint32_t *)(addr))
#define _STM32F411_REG16(addr)      (*(volatile uint16_t *)(addr))
#define _STM32F411_REG8(addr)       (*(volatile uint8_t *)(addr))

#define STM32F411_BIT(n)            (1UL << (n))

/*---------------------------------------------------------------------------*/
/* MEMORY MAP                                                                */
/*---------------------------------------------------------------------------*/

#define STM32F411_FLASH_MEM_BASE    0x08000000UL
#define STM32F411_SRAM_BASE         0x20000000UL
#define STM32F411_PERIPH_BASE       0x40000000UL

#define STM32F411_APB1_BASE         0x40000000UL
#define STM32F411_APB2_BASE         0x40010000UL
#define STM32F411_AHB1_BASE         0x40020000UL
#define STM32F411_AHB2_BASE         0x50000000UL

/* APB1 peripherals. */
#define STM32F411_TIM2_BASE         (STM32F411_APB1_BASE + 0x0000UL)
#define STM32F411_TIM3_BASE         (STM32F411_APB1_BASE + 0x0400UL)
#define STM32F411_TIM4_BASE         (STM32F411_APB1_BASE + 0x0800UL)
#define STM32F411_TIM5_BASE         (STM32F411_APB1_BASE + 0x0C00UL)
#define STM32F411_RTC_BASE          (STM32F411_APB1_BASE + 0x2800UL)
#define STM32F411_WWDG_BASE         (STM32F411_APB1_BASE + 0x2C00UL)
#define STM32F411_IWDG_BASE         (STM32F411_APB1_BASE + 0x3000UL)
#define STM32F411_I2S2EXT_BASE      (STM32F411_APB1_BASE + 0x3400UL)
#define STM32F411_SPI2_BASE         (STM32F411_APB1_BASE + 0x3800UL)
#define STM32F411_SPI3_BASE         (STM32F411_APB1_BASE + 0x3C00UL)
#define STM32F411_I2S3EXT_BASE      (STM32F411_APB1_BASE + 0x4000UL)
#define STM32F411_USART2_BASE       (STM32F411_APB1_BASE + 0x4400UL)
#define STM32F411_I2C1_BASE         (STM32F411_APB1_BASE + 0x5400UL)
#define STM32F411_I2C2_BASE         (STM32F411_APB1_BASE + 0x5800UL)
#define STM32F411_I2C3_BASE         (STM32F411_APB1_BASE + 0x5C00UL)
#define STM32F411_PWR_BASE          (STM32F411_APB1_BASE + 0x7000UL)

/* APB2 peripherals. */
#define STM32F411_TIM1_BASE         (STM32F411_APB2_BASE + 0x0000UL)
#define STM32F411_USART1_BASE       (STM32F411_APB2_BASE + 0x1000UL)
#define STM32F411_USART6_BASE       (STM32F411_APB2_BASE + 0x1400UL)
#define STM32F411_ADC1_BASE         (STM32F411_APB2_BASE + 0x2000UL)
#define STM32F411_ADC_COMMON_BASE   (STM32F411_APB2_BASE + 0x2300UL)
#define STM32F411_SDIO_BASE         (STM32F411_APB2_BASE + 0x2C00UL)
#define STM32F411_SPI1_BASE         (STM32F411_APB2_BASE + 0x3000UL)
#define STM32F411_SPI4_BASE         (STM32F411_APB2_BASE + 0x3400UL)
#define STM32F411_SYSCFG_BASE       (STM32F411_APB2_BASE + 0x3800UL)
#define STM32F411_EXTI_BASE         (STM32F411_APB2_BASE + 0x3C00UL)
#define STM32F411_TIM9_BASE         (STM32F411_APB2_BASE + 0x4000UL)
#define STM32F411_TIM10_BASE        (STM32F411_APB2_BASE + 0x4400UL)
#define STM32F411_TIM11_BASE        (STM32F411_APB2_BASE + 0x4800UL)
#define STM32F411_SPI5_BASE         (STM32F411_APB2_BASE + 0x5000UL)

/* AHB1/AHB2 peripherals. */
#define STM32F411_GPIOA_BASE        (STM32F411_AHB1_BASE + 0x0000UL)
#define STM32F411_GPIOB_BASE        (STM32F411_AHB1_BASE + 0x0400UL)
#define STM32F411_GPIOC_BASE        (STM32F411_AHB1_BASE + 0x0800UL)
#define STM32F411_GPIOD_BASE        (STM32F411_AHB1_BASE + 0x0C00UL)
#define STM32F411_GPIOE_BASE        (STM32F411_AHB1_BASE + 0x1000UL)
#define STM32F411_GPIOH_BASE        (STM32F411_AHB1_BASE + 0x1C00UL)
#define STM32F411_CRC_BASE          (STM32F411_AHB1_BASE + 0x3000UL)
#define STM32F411_RCC_BASE          (STM32F411_AHB1_BASE + 0x3800UL)
#define STM32F411_FLASH_BASE        (STM32F411_AHB1_BASE + 0x3C00UL)
#define STM32F411_DMA1_BASE         (STM32F411_AHB1_BASE + 0x6000UL)
#define STM32F411_DMA2_BASE         (STM32F411_AHB1_BASE + 0x6400UL)
#define STM32F411_OTG_FS_BASE       (STM32F411_AHB2_BASE + 0x0000UL)

/* Factory/system memory. */
#define STM32F411_SYSTEM_MEM_BASE   0x1FFF0000UL
#define STM32F411_UID_BASE          0x1FFF7A10UL
#define STM32F411_FLASH_SIZE_REG    0x1FFF7A22UL

/* Cortex-M4 private peripheral bus. */
#define STM32F411_PPB_BASE          0xE0000000UL
#define STM32F411_SYST_BASE         (STM32F411_PPB_BASE + 0xE010UL)
#define STM32F411_NVIC_BASE         (STM32F411_PPB_BASE + 0xE100UL)
#define STM32F411_SCB_BASE          (STM32F411_PPB_BASE + 0xED00UL)
#define STM32F411_MPU_BASE          (STM32F411_PPB_BASE + 0xED90UL)
#define STM32F411_DBGMCU_BASE       0xE0042000UL

/*---------------------------------------------------------------------------*/
/* FLASH INTERFACE                                                           */
/*---------------------------------------------------------------------------*/

#define STM32F411_FLASH_ACR         (STM32F411_FLASH_BASE + 0x00U)
#define STM32F411_FLASH_KEYR        (STM32F411_FLASH_BASE + 0x04U)
#define STM32F411_FLASH_OPTKEYR     (STM32F411_FLASH_BASE + 0x08U)
#define STM32F411_FLASH_SR          (STM32F411_FLASH_BASE + 0x0CU)
#define STM32F411_FLASH_CR          (STM32F411_FLASH_BASE + 0x10U)
#define STM32F411_FLASH_OPTCR       (STM32F411_FLASH_BASE + 0x14U)

#define STM32F411_FLASH_ACR_LATENCY_MASK 0x0FU
#define STM32F411_FLASH_ACR_LATENCY(n)   ((uint32_t)(n) & STM32F411_FLASH_ACR_LATENCY_MASK)
#define STM32F411_FLASH_ACR_PRFTEN       STM32F411_BIT(8)
#define STM32F411_FLASH_ACR_ICEN         STM32F411_BIT(9)
#define STM32F411_FLASH_ACR_DCEN         STM32F411_BIT(10)
#define STM32F411_FLASH_ACR_ICRST        STM32F411_BIT(11)
#define STM32F411_FLASH_ACR_DCRST        STM32F411_BIT(12)

