tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
#define STM32F411_FLASH_SR_EOP           STM32F411_BIT(0)
#define STM32F411_FLASH_SR_OPERR         STM32F411_BIT(1)
#define STM32F411_FLASH_SR_WRPERR        STM32F411_BIT(4)
#define STM32F411_FLASH_SR_PGAERR        STM32F411_BIT(5)
#define STM32F411_FLASH_SR_PGPERR        STM32F411_BIT(6)
#define STM32F411_FLASH_SR_PGSERR        STM32F411_BIT(7)
#define STM32F411_FLASH_SR_RDERR         STM32F411_BIT(8)
#define STM32F411_FLASH_SR_BSY           STM32F411_BIT(16)

#define STM32F411_FLASH_CR_PG            STM32F411_BIT(0)
#define STM32F411_FLASH_CR_SER           STM32F411_BIT(1)
#define STM32F411_FLASH_CR_MER           STM32F411_BIT(2)
#define STM32F411_FLASH_CR_SNB_SHIFT     3
#define STM32F411_FLASH_CR_SNB_MASK      (0x0FU << STM32F411_FLASH_CR_SNB_SHIFT)
#define STM32F411_FLASH_CR_PSIZE_SHIFT   8
#define STM32F411_FLASH_CR_PSIZE_MASK    (0x03U << STM32F411_FLASH_CR_PSIZE_SHIFT)
#define STM32F411_FLASH_CR_PSIZE_X8      (0U << STM32F411_FLASH_CR_PSIZE_SHIFT)
#define STM32F411_FLASH_CR_PSIZE_X16     (1U << STM32F411_FLASH_CR_PSIZE_SHIFT)
#define STM32F411_FLASH_CR_PSIZE_X32     (2U << STM32F411_FLASH_CR_PSIZE_SHIFT)
#define STM32F411_FLASH_CR_PSIZE_X64     (3U << STM32F411_FLASH_CR_PSIZE_SHIFT)
#define STM32F411_FLASH_CR_STRT          STM32F411_BIT(16)
#define STM32F411_FLASH_CR_EOPIE         STM32F411_BIT(24)
#define STM32F411_FLASH_CR_ERRIE         STM32F411_BIT(25)
#define STM32F411_FLASH_CR_LOCK          STM32F411_BIT(31)

/*---------------------------------------------------------------------------*/
/* RCC                                                                       */
/*---------------------------------------------------------------------------*/

#define STM32F411_RCC_CR            (STM32F411_RCC_BASE + 0x00U)
#define STM32F411_RCC_PLLCFGR       (STM32F411_RCC_BASE + 0x04U)
#define STM32F411_RCC_CFGR          (STM32F411_RCC_BASE + 0x08U)
#define STM32F411_RCC_CIR           (STM32F411_RCC_BASE + 0x0CU)
#define STM32F411_RCC_AHB1RSTR      (STM32F411_RCC_BASE + 0x10U)
#define STM32F411_RCC_AHB2RSTR      (STM32F411_RCC_BASE + 0x14U)
#define STM32F411_RCC_APB1RSTR      (STM32F411_RCC_BASE + 0x20U)
#define STM32F411_RCC_APB2RSTR      (STM32F411_RCC_BASE + 0x24U)
#define STM32F411_RCC_AHB1ENR       (STM32F411_RCC_BASE + 0x30U)
#define STM32F411_RCC_AHB2ENR       (STM32F411_RCC_BASE + 0x34U)
#define STM32F411_RCC_APB1ENR       (STM32F411_RCC_BASE + 0x40U)
#define STM32F411_RCC_APB2ENR       (STM32F411_RCC_BASE + 0x44U)
#define STM32F411_RCC_AHB1LPENR     (STM32F411_RCC_BASE + 0x50U)
#define STM32F411_RCC_AHB2LPENR     (STM32F411_RCC_BASE + 0x54U)
#define STM32F411_RCC_APB1LPENR     (STM32F411_RCC_BASE + 0x60U)
#define STM32F411_RCC_APB2LPENR     (STM32F411_RCC_BASE + 0x64U)
#define STM32F411_RCC_BDCR          (STM32F411_RCC_BASE + 0x70U)
#define STM32F411_RCC_CSR           (STM32F411_RCC_BASE + 0x74U)
#define STM32F411_RCC_SSCGR         (STM32F411_RCC_BASE + 0x80U)
#define STM32F411_RCC_PLLI2SCFGR    (STM32F411_RCC_BASE + 0x84U)
#define STM32F411_RCC_DCKCFGR       (STM32F411_RCC_BASE + 0x8CU)

#define STM32F411_RCC_CR_HSION      STM32F411_BIT(0)
#define STM32F411_RCC_CR_HSIRDY     STM32F411_BIT(1)
#define STM32F411_RCC_CR_HSITRIM_SHIFT 3
#define STM32F411_RCC_CR_HSITRIM_MASK  (0x1FU << STM32F411_RCC_CR_HSITRIM_SHIFT)
#define STM32F411_RCC_CR_HSICAL_SHIFT  8
#define STM32F411_RCC_CR_HSEON      STM32F411_BIT(16)
#define STM32F411_RCC_CR_HSERDY     STM32F411_BIT(17)
#define STM32F411_RCC_CR_HSEBYP     STM32F411_BIT(18)
#define STM32F411_RCC_CR_CSSON      STM32F411_BIT(19)
#define STM32F411_RCC_CR_PLLON      STM32F411_BIT(24)
#define STM32F411_RCC_CR_PLLRDY     STM32F411_BIT(25)
#define STM32F411_RCC_CR_PLLI2SON   STM32F411_BIT(26)
#define STM32F411_RCC_CR_PLLI2SRDY  STM32F411_BIT(27)

#define STM32F411_RCC_PLLCFGR_PLLM_SHIFT    0
#define STM32F411_RCC_PLLCFGR_PLLM_MASK     (0x3FU << STM32F411_RCC_PLLCFGR_PLLM_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLN_SHIFT    6
#define STM32F411_RCC_PLLCFGR_PLLN_MASK     (0x1FFU << STM32F411_RCC_PLLCFGR_PLLN_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLP_SHIFT    16
#define STM32F411_RCC_PLLCFGR_PLLP_MASK     (0x03U << STM32F411_RCC_PLLCFGR_PLLP_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLSRC_HSI    0U
#define STM32F411_RCC_PLLCFGR_PLLSRC_HSE    STM32F411_BIT(22)
#define STM32F411_RCC_PLLCFGR_PLLQ_SHIFT    24
#define STM32F411_RCC_PLLCFGR_PLLQ_MASK     (0x0FU << STM32F411_RCC_PLLCFGR_PLLQ_SHIFT)

#define STM32F411_RCC_PLLCFGR_PLLM(v)       (((uint32_t)(v) << STM32F411_RCC_PLLCFGR_PLLM_SHIFT) & STM32F411_RCC_PLLCFGR_PLLM_MASK)
#define STM32F411_RCC_PLLCFGR_PLLN(v)       (((uint32_t)(v) << STM32F411_RCC_PLLCFGR_PLLN_SHIFT) & STM32F411_RCC_PLLCFGR_PLLN_MASK)
#define STM32F411_RCC_PLLCFGR_PLLP_DIV2     (0U << STM32F411_RCC_PLLCFGR_PLLP_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLP_DIV4     (1U << STM32F411_RCC_PLLCFGR_PLLP_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLP_DIV6     (2U << STM32F411_RCC_PLLCFGR_PLLP_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLP_DIV8     (3U << STM32F411_RCC_PLLCFGR_PLLP_SHIFT)
#define STM32F411_RCC_PLLCFGR_PLLQ(v)       (((uint32_t)(v) << STM32F411_RCC_PLLCFGR_PLLQ_SHIFT) & STM32F411_RCC_PLLCFGR_PLLQ_MASK)

#define STM32F411_RCC_CFGR_SW_MASK          0x03U
#define STM32F411_RCC_CFGR_SW_HSI           0x00U
#define STM32F411_RCC_CFGR_SW_HSE           0x01U
#define STM32F411_RCC_CFGR_SW_PLL           0x02U
#define STM32F411_RCC_CFGR_SWS_SHIFT        2
#define STM32F411_RCC_CFGR_SWS_MASK         (0x03U << STM32F411_RCC_CFGR_SWS_SHIFT)
#define STM32F411_RCC_CFGR_SWS_HSI          (0x00U << STM32F411_RCC_CFGR_SWS_SHIFT)
#define STM32F411_RCC_CFGR_SWS_HSE          (0x01U << STM32F411_RCC_CFGR_SWS_SHIFT)
#define STM32F411_RCC_CFGR_SWS_PLL          (0x02U << STM32F411_RCC_CFGR_SWS_SHIFT)
#define STM32F411_RCC_CFGR_HPRE_DIV1        (0x0U << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV2        (0x8U << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV4        (0x9U << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV8        (0xAU << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV16       (0xBU << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV64       (0xCU << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV128      (0xDU << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV256      (0xEU << 4)
#define STM32F411_RCC_CFGR_HPRE_DIV512      (0xFU << 4)
#define STM32F411_RCC_CFGR_PPRE1_DIV1       (0x0U << 10)
#define STM32F411_RCC_CFGR_PPRE1_DIV2       (0x4U << 10)
#define STM32F411_RCC_CFGR_PPRE1_DIV4       (0x5U << 10)
#define STM32F411_RCC_CFGR_PPRE1_DIV8       (0x6U << 10)
#define STM32F411_RCC_CFGR_PPRE1_DIV16      (0x7U << 10)
#define STM32F411_RCC_CFGR_PPRE2_DIV1       (0x0U << 13)
#define STM32F411_RCC_CFGR_PPRE2_DIV2       (0x4U << 13)
#define STM32F411_RCC_CFGR_PPRE2_DIV4       (0x5U << 13)
#define STM32F411_RCC_CFGR_PPRE2_DIV8       (0x6U << 13)
#define STM32F411_RCC_CFGR_PPRE2_DIV16      (0x7U << 13)

/* AHB1 enable/reset bits. */
#define STM32F411_RCC_AHB1_GPIOA    STM32F411_BIT(0)
#define STM32F411_RCC_AHB1_GPIOB    STM32F411_BIT(1)
#define STM32F411_RCC_AHB1_GPIOC    STM32F411_BIT(2)
#define STM32F411_RCC_AHB1_GPIOD    STM32F411_BIT(3)
#define STM32F411_RCC_AHB1_GPIOE    STM32F411_BIT(4)
#define STM32F411_RCC_AHB1_GPIOH    STM32F411_BIT(7)
#define STM32F411_RCC_AHB1_CRC      STM32F411_BIT(12)
#define STM32F411_RCC_AHB1_DMA1     STM32F411_BIT(21)
#define STM32F411_RCC_AHB1_DMA2     STM32F411_BIT(22)

/* AHB2 enable/reset bits. */
#define STM32F411_RCC_AHB2_OTGFS    STM32F411_BIT(7)

/* APB1 enable/reset bits. */
#define STM32F411_RCC_APB1_TIM2     STM32F411_BIT(0)
#define STM32F411_RCC_APB1_TIM3     STM32F411_BIT(1)
#define STM32F411_RCC_APB1_TIM4     STM32F411_BIT(2)
#define STM32F411_RCC_APB1_TIM5     STM32F411_BIT(3)
#define STM32F411_RCC_APB1_WWDG     STM32F411_BIT(11)
#define STM32F411_RCC_APB1_SPI2     STM32F411_BIT(14)
#define STM32F411_RCC_APB1_SPI3     STM32F411_BIT(15)
#define STM32F411_RCC_APB1_USART2   STM32F411_BIT(17)
#define STM32F411_RCC_APB1_I2C1     STM32F411_BIT(21)
#define STM32F411_RCC_APB1_I2C2     STM32F411_BIT(22)
#define STM32F411_RCC_APB1_I2C3     STM32F411_BIT(23)
#define STM32F411_RCC_APB1_PWR      STM32F411_BIT(28)

/* APB2 enable/reset bits. */
#define STM32F411_RCC_APB2_TIM1     STM32F411_BIT(0)
#define STM32F411_RCC_APB2_USART1   STM32F411_BIT(4)
#define STM32F411_RCC_APB2_USART6   STM32F411_BIT(5)
#define STM32F411_RCC_APB2_ADC1     STM32F411_BIT(8)
#define STM32F411_RCC_APB2_SDIO     STM32F411_BIT(11)
#define STM32F411_RCC_APB2_SPI1     STM32F411_BIT(12)
#define STM32F411_RCC_APB2_SPI4     STM32F411_BIT(13)
#define STM32F411_RCC_APB2_SYSCFG   STM32F411_BIT(14)
#define STM32F411_RCC_APB2_TIM9     STM32F411_BIT(16)
#define STM32F411_RCC_APB2_TIM10    STM32F411_BIT(17)
#define STM32F411_RCC_APB2_TIM11    STM32F411_BIT(18)
#define STM32F411_RCC_APB2_SPI5     STM32F411_BIT(20)

/* Reset-cause flags in RCC_CSR. */
#define STM32F411_RCC_CSR_LSION     STM32F411_BIT(0)
#define STM32F411_RCC_CSR_LSIRDY    STM32F411_BIT(1)
#define STM32F411_RCC_CSR_RMVF      STM32F411_BIT(24)
#define STM32F411_RCC_CSR_BORRSTF   STM32F411_BIT(25)
#define STM32F411_RCC_CSR_PINRSTF   STM32F411_BIT(26)
#define STM32F411_RCC_CSR_PORRSTF   STM32F411_BIT(27)
#define STM32F411_RCC_CSR_SFTRSTF   STM32F411_BIT(28)
#define STM32F411_RCC_CSR_IWDGRSTF  STM32F411_BIT(29)
#define STM32F411_RCC_CSR_WWDGRSTF  STM32F411_BIT(30)
#define STM32F411_RCC_CSR_LPWRRSTF  STM32F411_BIT(31)

#define STM32F411_RCC_BDCR_LSEON    STM32F411_BIT(0)
#define STM32F411_RCC_BDCR_LSERDY   STM32F411_BIT(1)
#define STM32F411_RCC_BDCR_LSEBYP   STM32F411_BIT(2)
#define STM32F411_RCC_BDCR_RTCSEL_SHIFT 8
#define STM32F411_RCC_BDCR_RTCSEL_MASK  (0x03U << STM32F411_RCC_BDCR_RTCSEL_SHIFT)
#define STM32F411_RCC_BDCR_RTCSEL_NONE  (0x00U << STM32F411_RCC_BDCR_RTCSEL_SHIFT)
#define STM32F411_RCC_BDCR_RTCSEL_LSE   (0x01U << STM32F411_RCC_BDCR_RTCSEL_SHIFT)
#define STM32F411_RCC_BDCR_RTCSEL_LSI   (0x02U << STM32F411_RCC_BDCR_RTCSEL_SHIFT)
#define STM32F411_RCC_BDCR_RTCSEL_HSE   (0x03U << STM32F411_RCC_BDCR_RTCSEL_SHIFT)
#define STM32F411_RCC_BDCR_RTCEN    STM32F411_BIT(15)
#define STM32F411_RCC_BDCR_BDRST    STM32F411_BIT(16)

static inline void stm32f411_rcc_enable_ahb1(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_AHB1ENR) |= mask;
    (void)_STM32F411_REG(STM32F411_RCC_AHB1ENR);
}

static inline void stm32f411_rcc_enable_ahb2(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_AHB2ENR) |= mask;
    (void)_STM32F411_REG(STM32F411_RCC_AHB2ENR);
}

