tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
static inline void stm32f411_rcc_enable_apb1(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_APB1ENR) |= mask;
    (void)_STM32F411_REG(STM32F411_RCC_APB1ENR);
}

static inline void stm32f411_rcc_enable_apb2(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_APB2ENR) |= mask;
    (void)_STM32F411_REG(STM32F411_RCC_APB2ENR);
}

static inline void stm32f411_rcc_reset_ahb1(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_AHB1RSTR) |= mask;
    _STM32F411_REG(STM32F411_RCC_AHB1RSTR) &= ~mask;
}

static inline void stm32f411_rcc_reset_ahb2(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_AHB2RSTR) |= mask;
    _STM32F411_REG(STM32F411_RCC_AHB2RSTR) &= ~mask;
}

static inline void stm32f411_rcc_reset_apb1(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_APB1RSTR) |= mask;
    _STM32F411_REG(STM32F411_RCC_APB1RSTR) &= ~mask;
}

static inline void stm32f411_rcc_reset_apb2(uint32_t mask) {
    _STM32F411_REG(STM32F411_RCC_APB2RSTR) |= mask;
    _STM32F411_REG(STM32F411_RCC_APB2RSTR) &= ~mask;
}

/*---------------------------------------------------------------------------*/
/* GPIO                                                                      */
/*---------------------------------------------------------------------------*/

#define STM32F411_GPIO_MODER(base)      ((base) + 0x00U)
#define STM32F411_GPIO_OTYPER(base)     ((base) + 0x04U)
#define STM32F411_GPIO_OSPEEDR(base)    ((base) + 0x08U)
#define STM32F411_GPIO_PUPDR(base)      ((base) + 0x0CU)
#define STM32F411_GPIO_IDR(base)        ((base) + 0x10U)
#define STM32F411_GPIO_ODR(base)        ((base) + 0x14U)
#define STM32F411_GPIO_BSRR(base)       ((base) + 0x18U)
#define STM32F411_GPIO_LCKR(base)       ((base) + 0x1CU)
#define STM32F411_GPIO_AFRL(base)       ((base) + 0x20U)
#define STM32F411_GPIO_AFRH(base)       ((base) + 0x24U)

#define STM32F411_GPIO_MODE_INPUT       0U
#define STM32F411_GPIO_MODE_OUTPUT      1U
#define STM32F411_GPIO_MODE_AF          2U
#define STM32F411_GPIO_MODE_ANALOG      3U
#define STM32F411_GPIO_MODE(pin, mode)  ((uint32_t)(mode) << (2U * (uint32_t)(pin)))

#define STM32F411_GPIO_OTYPE_PP         0U
#define STM32F411_GPIO_OTYPE_OD(pin)    STM32F411_BIT(pin)

#define STM32F411_GPIO_SPEED_LOW        0U
#define STM32F411_GPIO_SPEED_MEDIUM     1U
#define STM32F411_GPIO_SPEED_FAST       2U
#define STM32F411_GPIO_SPEED_HIGH       3U
#define STM32F411_GPIO_SPEED(pin, spd)  ((uint32_t)(spd) << (2U * (uint32_t)(pin)))

#define STM32F411_GPIO_PUPD_NONE        0U
#define STM32F411_GPIO_PUPD_UP          1U
#define STM32F411_GPIO_PUPD_DOWN        2U
#define STM32F411_GPIO_PUPD(pin, pupd)  ((uint32_t)(pupd) << (2U * (uint32_t)(pin)))

#define STM32F411_GPIO_BSRR_SET(pin)    STM32F411_BIT(pin)
#define STM32F411_GPIO_BSRR_CLR(pin)    STM32F411_BIT((uint32_t)(pin) + 16U)

#define STM32F411_GPIO_AF_SYS           0U
#define STM32F411_GPIO_AF_TIM1_TIM2     1U
#define STM32F411_GPIO_AF_TIM3_5        2U
#define STM32F411_GPIO_AF_TIM9_11       3U
#define STM32F411_GPIO_AF_I2C1_3        4U
#define STM32F411_GPIO_AF_SPI1_2_4_5    5U
#define STM32F411_GPIO_AF_SPI3          6U
#define STM32F411_GPIO_AF_USART1_2      7U
#define STM32F411_GPIO_AF_USART6        8U
#define STM32F411_GPIO_AF_OTG_FS        10U
#define STM32F411_GPIO_AF_SDIO          12U

static inline void stm32f411_gpio_set_af(uint32_t gpio_base,
                                         uint8_t pin,
                                         uint8_t af) {
    uint32_t reg = (pin < 8U) ? STM32F411_GPIO_AFRL(gpio_base)
                              : STM32F411_GPIO_AFRH(gpio_base);
    uint32_t shift = (uint32_t)(pin & 7U) * 4U;
    uint32_t val = _STM32F411_REG(reg);
    val &= ~(0x0FUL << shift);
    val |= ((uint32_t)af & 0x0FU) << shift;
    _STM32F411_REG(reg) = val;
}

/*---------------------------------------------------------------------------*/
/* SYSCFG AND EXTI                                                           */
/*---------------------------------------------------------------------------*/

#define STM32F411_SYSCFG_MEMRMP     (STM32F411_SYSCFG_BASE + 0x00U)
#define STM32F411_SYSCFG_PMC        (STM32F411_SYSCFG_BASE + 0x04U)
#define STM32F411_SYSCFG_EXTICR(i)  (STM32F411_SYSCFG_BASE + 0x08U + ((uint32_t)(i) * 4U))
#define STM32F411_SYSCFG_CMPCR      (STM32F411_SYSCFG_BASE + 0x20U)

#define STM32F411_SYSCFG_EXTI_PORTA 0U
#define STM32F411_SYSCFG_EXTI_PORTB 1U
#define STM32F411_SYSCFG_EXTI_PORTC 2U
#define STM32F411_SYSCFG_EXTI_PORTD 3U
#define STM32F411_SYSCFG_EXTI_PORTE 4U
#define STM32F411_SYSCFG_EXTI_PORTH 7U

#define STM32F411_EXTI_IMR          (STM32F411_EXTI_BASE + 0x00U)
#define STM32F411_EXTI_EMR          (STM32F411_EXTI_BASE + 0x04U)
#define STM32F411_EXTI_RTSR         (STM32F411_EXTI_BASE + 0x08U)
#define STM32F411_EXTI_FTSR         (STM32F411_EXTI_BASE + 0x0CU)
#define STM32F411_EXTI_SWIER        (STM32F411_EXTI_BASE + 0x10U)
#define STM32F411_EXTI_PR           (STM32F411_EXTI_BASE + 0x14U)
#define STM32F411_EXTI_LINE(n)      STM32F411_BIT(n)

/*---------------------------------------------------------------------------*/
/* USART                                                                     */
/*---------------------------------------------------------------------------*/

#define STM32F411_USART_SR(base)     ((base) + 0x00U)
#define STM32F411_USART_DR(base)     ((base) + 0x04U)
#define STM32F411_USART_BRR(base)    ((base) + 0x08U)
#define STM32F411_USART_CR1(base)    ((base) + 0x0CU)
#define STM32F411_USART_CR2(base)    ((base) + 0x10U)
#define STM32F411_USART_CR3(base)    ((base) + 0x14U)
#define STM32F411_USART_GTPR(base)   ((base) + 0x18U)

#define STM32F411_USART_SR_PE        STM32F411_BIT(0)
#define STM32F411_USART_SR_FE        STM32F411_BIT(1)
#define STM32F411_USART_SR_NF        STM32F411_BIT(2)
#define STM32F411_USART_SR_ORE       STM32F411_BIT(3)
#define STM32F411_USART_SR_IDLE      STM32F411_BIT(4)
#define STM32F411_USART_SR_RXNE      STM32F411_BIT(5)
#define STM32F411_USART_SR_TC        STM32F411_BIT(6)
#define STM32F411_USART_SR_TXE       STM32F411_BIT(7)
#define STM32F411_USART_SR_LBD       STM32F411_BIT(8)
#define STM32F411_USART_SR_CTS       STM32F411_BIT(9)

#define STM32F411_USART_DR_MASK      0x01FFU
#define STM32F411_USART_CR1_SBK      STM32F411_BIT(0)
#define STM32F411_USART_CR1_RWU      STM32F411_BIT(1)
#define STM32F411_USART_CR1_RE       STM32F411_BIT(2)
#define STM32F411_USART_CR1_TE       STM32F411_BIT(3)
#define STM32F411_USART_CR1_IDLEIE   STM32F411_BIT(4)
#define STM32F411_USART_CR1_RXNEIE   STM32F411_BIT(5)
#define STM32F411_USART_CR1_TCIE     STM32F411_BIT(6)
#define STM32F411_USART_CR1_TXEIE    STM32F411_BIT(7)
#define STM32F411_USART_CR1_PEIE     STM32F411_BIT(8)
#define STM32F411_USART_CR1_PS       STM32F411_BIT(9)
#define STM32F411_USART_CR1_PCE      STM32F411_BIT(10)
#define STM32F411_USART_CR1_WAKE     STM32F411_BIT(11)
#define STM32F411_USART_CR1_M        STM32F411_BIT(12)
#define STM32F411_USART_CR1_UE       STM32F411_BIT(13)
#define STM32F411_USART_CR1_OVER8    STM32F411_BIT(15)

#define STM32F411_USART_CR2_STOP_SHIFT 12
#define STM32F411_USART_CR2_STOP_MASK  (0x03U << STM32F411_USART_CR2_STOP_SHIFT)
#define STM32F411_USART_CR2_STOP_1     (0x00U << STM32F411_USART_CR2_STOP_SHIFT)
#define STM32F411_USART_CR2_STOP_0_5   (0x01U << STM32F411_USART_CR2_STOP_SHIFT)
#define STM32F411_USART_CR2_STOP_2     (0x02U << STM32F411_USART_CR2_STOP_SHIFT)
#define STM32F411_USART_CR2_STOP_1_5   (0x03U << STM32F411_USART_CR2_STOP_SHIFT)

#define STM32F411_USART_CR3_EIE      STM32F411_BIT(0)
#define STM32F411_USART_CR3_HDSEL    STM32F411_BIT(3)
#define STM32F411_USART_CR3_DMAR     STM32F411_BIT(6)
#define STM32F411_USART_CR3_DMAT     STM32F411_BIT(7)
#define STM32F411_USART_CR3_RTSE     STM32F411_BIT(8)
#define STM32F411_USART_CR3_CTSE     STM32F411_BIT(9)
#define STM32F411_USART_CR3_CTSIE    STM32F411_BIT(10)
#define STM32F411_USART_CR3_ONEBIT   STM32F411_BIT(11)

