tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
/*---------------------------------------------------------------------------*/
/* TIMERS                                                                    */
/*---------------------------------------------------------------------------*/

#define STM32F411_TIM_CR1(base)      ((base) + 0x00U)
#define STM32F411_TIM_CR2(base)      ((base) + 0x04U)
#define STM32F411_TIM_SMCR(base)     ((base) + 0x08U)
#define STM32F411_TIM_DIER(base)     ((base) + 0x0CU)
#define STM32F411_TIM_SR(base)       ((base) + 0x10U)
#define STM32F411_TIM_EGR(base)      ((base) + 0x14U)
#define STM32F411_TIM_CCMR1(base)    ((base) + 0x18U)
#define STM32F411_TIM_CCMR2(base)    ((base) + 0x1CU)
#define STM32F411_TIM_CCER(base)     ((base) + 0x20U)
#define STM32F411_TIM_CNT(base)      ((base) + 0x24U)
#define STM32F411_TIM_PSC(base)      ((base) + 0x28U)
#define STM32F411_TIM_ARR(base)      ((base) + 0x2CU)
#define STM32F411_TIM_RCR(base)      ((base) + 0x30U)
#define STM32F411_TIM_CCR1(base)     ((base) + 0x34U)
#define STM32F411_TIM_CCR2(base)     ((base) + 0x38U)
#define STM32F411_TIM_CCR3(base)     ((base) + 0x3CU)
#define STM32F411_TIM_CCR4(base)     ((base) + 0x40U)
#define STM32F411_TIM_BDTR(base)     ((base) + 0x44U)
#define STM32F411_TIM_DCR(base)      ((base) + 0x48U)
#define STM32F411_TIM_DMAR(base)     ((base) + 0x4CU)
#define STM32F411_TIM_OR(base)       ((base) + 0x50U)

#define STM32F411_TIM_CR1_CEN        STM32F411_BIT(0)
#define STM32F411_TIM_CR1_UDIS       STM32F411_BIT(1)
#define STM32F411_TIM_CR1_URS        STM32F411_BIT(2)
#define STM32F411_TIM_CR1_OPM        STM32F411_BIT(3)
#define STM32F411_TIM_CR1_DIR        STM32F411_BIT(4)
#define STM32F411_TIM_CR1_ARPE       STM32F411_BIT(7)
#define STM32F411_TIM_CR1_CKD_SHIFT  8

#define STM32F411_TIM_DIER_UIE       STM32F411_BIT(0)
#define STM32F411_TIM_DIER_CC1IE     STM32F411_BIT(1)
#define STM32F411_TIM_DIER_CC2IE     STM32F411_BIT(2)
#define STM32F411_TIM_DIER_CC3IE     STM32F411_BIT(3)
#define STM32F411_TIM_DIER_CC4IE     STM32F411_BIT(4)
#define STM32F411_TIM_DIER_UDE       STM32F411_BIT(8)
#define STM32F411_TIM_DIER_CC1DE     STM32F411_BIT(9)
#define STM32F411_TIM_DIER_CC2DE     STM32F411_BIT(10)
#define STM32F411_TIM_DIER_CC3DE     STM32F411_BIT(11)
#define STM32F411_TIM_DIER_CC4DE     STM32F411_BIT(12)

#define STM32F411_TIM_SR_UIF         STM32F411_BIT(0)
#define STM32F411_TIM_SR_CC1IF       STM32F411_BIT(1)
#define STM32F411_TIM_SR_CC2IF       STM32F411_BIT(2)
#define STM32F411_TIM_SR_CC3IF       STM32F411_BIT(3)
#define STM32F411_TIM_SR_CC4IF       STM32F411_BIT(4)
#define STM32F411_TIM_SR_TIF         STM32F411_BIT(6)
#define STM32F411_TIM_SR_CC1OF       STM32F411_BIT(9)
#define STM32F411_TIM_SR_CC2OF       STM32F411_BIT(10)
#define STM32F411_TIM_SR_CC3OF       STM32F411_BIT(11)
#define STM32F411_TIM_SR_CC4OF       STM32F411_BIT(12)

#define STM32F411_TIM_EGR_UG         STM32F411_BIT(0)
#define STM32F411_TIM_EGR_CC1G       STM32F411_BIT(1)
#define STM32F411_TIM_EGR_CC2G       STM32F411_BIT(2)
#define STM32F411_TIM_EGR_CC3G       STM32F411_BIT(3)
#define STM32F411_TIM_EGR_CC4G       STM32F411_BIT(4)

#define STM32F411_TIM_CCMR_OC_PE(ch) STM32F411_BIT((((uint32_t)(ch) & 1U) * 8U) + 3U)
#define STM32F411_TIM_CCMR_OCM_SHIFT(ch) ((((uint32_t)(ch) & 1U) * 8U) + 4U)
#define STM32F411_TIM_OCM_FROZEN     0U
#define STM32F411_TIM_OCM_ACTIVE     1U
#define STM32F411_TIM_OCM_INACTIVE   2U
#define STM32F411_TIM_OCM_TOGGLE     3U
#define STM32F411_TIM_OCM_FORCE_LOW  4U
#define STM32F411_TIM_OCM_FORCE_HIGH 5U
#define STM32F411_TIM_OCM_PWM1       6U
#define STM32F411_TIM_OCM_PWM2       7U

#define STM32F411_TIM_CCER_CC1E      STM32F411_BIT(0)
#define STM32F411_TIM_CCER_CC1P      STM32F411_BIT(1)
#define STM32F411_TIM_CCER_CC2E      STM32F411_BIT(4)
#define STM32F411_TIM_CCER_CC2P      STM32F411_BIT(5)
#define STM32F411_TIM_CCER_CC3E      STM32F411_BIT(8)
#define STM32F411_TIM_CCER_CC3P      STM32F411_BIT(9)
#define STM32F411_TIM_CCER_CC4E      STM32F411_BIT(12)
#define STM32F411_TIM_CCER_CC4P      STM32F411_BIT(13)
#define STM32F411_TIM_BDTR_MOE       STM32F411_BIT(15)

/*---------------------------------------------------------------------------*/
/* ADC1                                                                      */
/*---------------------------------------------------------------------------*/

#define STM32F411_ADC_SR            (STM32F411_ADC1_BASE + 0x00U)
#define STM32F411_ADC_CR1           (STM32F411_ADC1_BASE + 0x04U)
#define STM32F411_ADC_CR2           (STM32F411_ADC1_BASE + 0x08U)
#define STM32F411_ADC_SMPR1         (STM32F411_ADC1_BASE + 0x0CU)
#define STM32F411_ADC_SMPR2         (STM32F411_ADC1_BASE + 0x10U)
#define STM32F411_ADC_HTR           (STM32F411_ADC1_BASE + 0x24U)
#define STM32F411_ADC_LTR           (STM32F411_ADC1_BASE + 0x28U)
#define STM32F411_ADC_SQR1          (STM32F411_ADC1_BASE + 0x2CU)
#define STM32F411_ADC_SQR2          (STM32F411_ADC1_BASE + 0x30U)
#define STM32F411_ADC_SQR3          (STM32F411_ADC1_BASE + 0x34U)
#define STM32F411_ADC_JSQR          (STM32F411_ADC1_BASE + 0x38U)
#define STM32F411_ADC_DR            (STM32F411_ADC1_BASE + 0x4CU)

#define STM32F411_ADC_CSR           (STM32F411_ADC_COMMON_BASE + 0x00U)
#define STM32F411_ADC_CCR           (STM32F411_ADC_COMMON_BASE + 0x04U)
#define STM32F411_ADC_CDR           (STM32F411_ADC_COMMON_BASE + 0x08U)

#define STM32F411_ADC_SR_AWD        STM32F411_BIT(0)
#define STM32F411_ADC_SR_EOC        STM32F411_BIT(1)
#define STM32F411_ADC_SR_JEOC       STM32F411_BIT(2)
#define STM32F411_ADC_SR_JSTRT      STM32F411_BIT(3)
#define STM32F411_ADC_SR_STRT       STM32F411_BIT(4)
#define STM32F411_ADC_SR_OVR        STM32F411_BIT(5)

#define STM32F411_ADC_CR1_EOCIE     STM32F411_BIT(5)
#define STM32F411_ADC_CR1_AWDIE     STM32F411_BIT(6)
#define STM32F411_ADC_CR1_JEOCIE    STM32F411_BIT(7)
#define STM32F411_ADC_CR1_SCAN      STM32F411_BIT(8)
#define STM32F411_ADC_CR1_RES_SHIFT 24
#define STM32F411_ADC_CR1_RES_12BIT (0U << STM32F411_ADC_CR1_RES_SHIFT)
#define STM32F411_ADC_CR1_RES_10BIT (1U << STM32F411_ADC_CR1_RES_SHIFT)
#define STM32F411_ADC_CR1_RES_8BIT  (2U << STM32F411_ADC_CR1_RES_SHIFT)
#define STM32F411_ADC_CR1_RES_6BIT  (3U << STM32F411_ADC_CR1_RES_SHIFT)
#define STM32F411_ADC_CR1_OVRIE     STM32F411_BIT(26)

