tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
#define STM32F411_ADC_CR2_ADON      STM32F411_BIT(0)
#define STM32F411_ADC_CR2_CONT      STM32F411_BIT(1)
#define STM32F411_ADC_CR2_DMA       STM32F411_BIT(8)
#define STM32F411_ADC_CR2_DDS       STM32F411_BIT(9)
#define STM32F411_ADC_CR2_EOCS      STM32F411_BIT(10)
#define STM32F411_ADC_CR2_ALIGN     STM32F411_BIT(11)
#define STM32F411_ADC_CR2_SWSTART   STM32F411_BIT(30)

#define STM32F411_ADC_SQR1_L_SHIFT  20
#define STM32F411_ADC_SQR1_L_MASK   (0x0FU << STM32F411_ADC_SQR1_L_SHIFT)
#define STM32F411_ADC_SQR3_SQ1(ch)  ((uint32_t)(ch) & 0x1FU)
#define STM32F411_ADC_SMPR_CH_SHIFT(ch) (3U * ((uint32_t)(ch) % 10U))
#define STM32F411_ADC_SAMPLE_3CYCLES    0U
#define STM32F411_ADC_SAMPLE_15CYCLES   1U
#define STM32F411_ADC_SAMPLE_28CYCLES   2U
#define STM32F411_ADC_SAMPLE_56CYCLES   3U
#define STM32F411_ADC_SAMPLE_84CYCLES   4U
#define STM32F411_ADC_SAMPLE_112CYCLES  5U
#define STM32F411_ADC_SAMPLE_144CYCLES  6U
#define STM32F411_ADC_SAMPLE_480CYCLES  7U

#define STM32F411_ADC_CCR_ADCPRE_SHIFT 16
#define STM32F411_ADC_CCR_ADCPRE_PCLK2_DIV2 (0U << STM32F411_ADC_CCR_ADCPRE_SHIFT)
#define STM32F411_ADC_CCR_ADCPRE_PCLK2_DIV4 (1U << STM32F411_ADC_CCR_ADCPRE_SHIFT)
#define STM32F411_ADC_CCR_ADCPRE_PCLK2_DIV6 (2U << STM32F411_ADC_CCR_ADCPRE_SHIFT)
#define STM32F411_ADC_CCR_ADCPRE_PCLK2_DIV8 (3U << STM32F411_ADC_CCR_ADCPRE_SHIFT)
#define STM32F411_ADC_CCR_VBATE     STM32F411_BIT(22)
#define STM32F411_ADC_CCR_TSVREFE   STM32F411_BIT(23)

/*---------------------------------------------------------------------------*/
/* I2C                                                                       */
/*---------------------------------------------------------------------------*/

#define STM32F411_I2C_CR1(base)      ((base) + 0x00U)
#define STM32F411_I2C_CR2(base)      ((base) + 0x04U)
#define STM32F411_I2C_OAR1(base)     ((base) + 0x08U)
#define STM32F411_I2C_OAR2(base)     ((base) + 0x0CU)
#define STM32F411_I2C_DR(base)       ((base) + 0x10U)
#define STM32F411_I2C_SR1(base)      ((base) + 0x14U)
#define STM32F411_I2C_SR2(base)      ((base) + 0x18U)
#define STM32F411_I2C_CCR(base)      ((base) + 0x1CU)
#define STM32F411_I2C_TRISE(base)    ((base) + 0x20U)
#define STM32F411_I2C_FLTR(base)     ((base) + 0x24U)

#define STM32F411_I2C_CR1_PE         STM32F411_BIT(0)
#define STM32F411_I2C_CR1_SMBUS      STM32F411_BIT(1)
#define STM32F411_I2C_CR1_SMBTYPE    STM32F411_BIT(3)
#define STM32F411_I2C_CR1_ENARP      STM32F411_BIT(4)
#define STM32F411_I2C_CR1_ENPEC      STM32F411_BIT(5)
#define STM32F411_I2C_CR1_ENGC       STM32F411_BIT(6)
#define STM32F411_I2C_CR1_NOSTRETCH  STM32F411_BIT(7)
#define STM32F411_I2C_CR1_START      STM32F411_BIT(8)
#define STM32F411_I2C_CR1_STOP       STM32F411_BIT(9)
#define STM32F411_I2C_CR1_ACK        STM32F411_BIT(10)
#define STM32F411_I2C_CR1_POS        STM32F411_BIT(11)
#define STM32F411_I2C_CR1_PEC        STM32F411_BIT(12)
#define STM32F411_I2C_CR1_ALERT      STM32F411_BIT(13)
#define STM32F411_I2C_CR1_SWRST      STM32F411_BIT(15)

#define STM32F411_I2C_CR2_FREQ_MASK  0x3FU
#define STM32F411_I2C_CR2_ITERREN    STM32F411_BIT(8)
#define STM32F411_I2C_CR2_ITEVTEN    STM32F411_BIT(9)
#define STM32F411_I2C_CR2_ITBUFEN    STM32F411_BIT(10)
#define STM32F411_I2C_CR2_DMAEN      STM32F411_BIT(11)
#define STM32F411_I2C_CR2_LAST       STM32F411_BIT(12)

#define STM32F411_I2C_SR1_SB         STM32F411_BIT(0)
#define STM32F411_I2C_SR1_ADDR       STM32F411_BIT(1)
#define STM32F411_I2C_SR1_BTF        STM32F411_BIT(2)
#define STM32F411_I2C_SR1_ADD10      STM32F411_BIT(3)
#define STM32F411_I2C_SR1_STOPF      STM32F411_BIT(4)
#define STM32F411_I2C_SR1_RXNE       STM32F411_BIT(6)
#define STM32F411_I2C_SR1_TXE        STM32F411_BIT(7)
#define STM32F411_I2C_SR1_BERR       STM32F411_BIT(8)
#define STM32F411_I2C_SR1_ARLO       STM32F411_BIT(9)
#define STM32F411_I2C_SR1_AF         STM32F411_BIT(10)
#define STM32F411_I2C_SR1_OVR        STM32F411_BIT(11)
#define STM32F411_I2C_SR1_PECERR     STM32F411_BIT(12)
#define STM32F411_I2C_SR1_TIMEOUT    STM32F411_BIT(14)
#define STM32F411_I2C_SR1_SMBALERT   STM32F411_BIT(15)

#define STM32F411_I2C_SR2_MSL        STM32F411_BIT(0)
#define STM32F411_I2C_SR2_BUSY       STM32F411_BIT(1)
#define STM32F411_I2C_SR2_TRA        STM32F411_BIT(2)

#define STM32F411_I2C_CCR_CCR_MASK   0x0FFFU
#define STM32F411_I2C_CCR_DUTY       STM32F411_BIT(14)
#define STM32F411_I2C_CCR_FS         STM32F411_BIT(15)

/*---------------------------------------------------------------------------*/
/* SPI / I2S                                                                 */
/*---------------------------------------------------------------------------*/

#define STM32F411_SPI_CR1(base)      ((base) + 0x00U)
#define STM32F411_SPI_CR2(base)      ((base) + 0x04U)
#define STM32F411_SPI_SR(base)       ((base) + 0x08U)
#define STM32F411_SPI_DR(base)       ((base) + 0x0CU)
#define STM32F411_SPI_CRCPR(base)    ((base) + 0x10U)
#define STM32F411_SPI_RXCRCR(base)   ((base) + 0x14U)
#define STM32F411_SPI_TXCRCR(base)   ((base) + 0x18U)
#define STM32F411_SPI_I2SCFGR(base)  ((base) + 0x1CU)
#define STM32F411_SPI_I2SPR(base)    ((base) + 0x20U)

#define STM32F411_SPI_CR1_CPHA       STM32F411_BIT(0)
#define STM32F411_SPI_CR1_CPOL       STM32F411_BIT(1)
#define STM32F411_SPI_CR1_MSTR       STM32F411_BIT(2)
#define STM32F411_SPI_CR1_BR_SHIFT   3
#define STM32F411_SPI_CR1_BR_MASK    (0x07U << STM32F411_SPI_CR1_BR_SHIFT)
#define STM32F411_SPI_CR1_SPE        STM32F411_BIT(6)
#define STM32F411_SPI_CR1_LSBFIRST   STM32F411_BIT(7)
#define STM32F411_SPI_CR1_SSI        STM32F411_BIT(8)
#define STM32F411_SPI_CR1_SSM        STM32F411_BIT(9)
#define STM32F411_SPI_CR1_RXONLY     STM32F411_BIT(10)
#define STM32F411_SPI_CR1_DFF        STM32F411_BIT(11)
#define STM32F411_SPI_CR1_CRCNEXT    STM32F411_BIT(12)
#define STM32F411_SPI_CR1_CRCEN      STM32F411_BIT(13)
#define STM32F411_SPI_CR1_BIDIOE     STM32F411_BIT(14)
#define STM32F411_SPI_CR1_BIDIMODE   STM32F411_BIT(15)

#define STM32F411_SPI_CR2_RXDMAEN    STM32F411_BIT(0)
#define STM32F411_SPI_CR2_TXDMAEN    STM32F411_BIT(1)
#define STM32F411_SPI_CR2_SSOE       STM32F411_BIT(2)
#define STM32F411_SPI_CR2_FRF        STM32F411_BIT(4)
#define STM32F411_SPI_CR2_ERRIE      STM32F411_BIT(5)
#define STM32F411_SPI_CR2_RXNEIE     STM32F411_BIT(6)
#define STM32F411_SPI_CR2_TXEIE      STM32F411_BIT(7)

#define STM32F411_SPI_SR_RXNE        STM32F411_BIT(0)
#define STM32F411_SPI_SR_TXE         STM32F411_BIT(1)
#define STM32F411_SPI_SR_CHSIDE      STM32F411_BIT(2)
#define STM32F411_SPI_SR_UDR         STM32F411_BIT(3)
#define STM32F411_SPI_SR_CRCERR      STM32F411_BIT(4)
#define STM32F411_SPI_SR_MODF        STM32F411_BIT(5)
#define STM32F411_SPI_SR_OVR         STM32F411_BIT(6)
#define STM32F411_SPI_SR_BSY         STM32F411_BIT(7)
#define STM32F411_SPI_SR_FRE         STM32F411_BIT(8)

