tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
/*---------------------------------------------------------------------------*/
/* DMA                                                                       */
/*---------------------------------------------------------------------------*/

#define STM32F411_DMA_LISR(base)     ((base) + 0x00U)
#define STM32F411_DMA_HISR(base)     ((base) + 0x04U)
#define STM32F411_DMA_LIFCR(base)    ((base) + 0x08U)
#define STM32F411_DMA_HIFCR(base)    ((base) + 0x0CU)
#define STM32F411_DMA_STREAM(base, s) ((base) + 0x10U + (0x18U * (uint32_t)(s)))
#define STM32F411_DMA_SCR(base, s)   (STM32F411_DMA_STREAM((base), (s)) + 0x00U)
#define STM32F411_DMA_SNDTR(base, s) (STM32F411_DMA_STREAM((base), (s)) + 0x04U)
#define STM32F411_DMA_SPAR(base, s)  (STM32F411_DMA_STREAM((base), (s)) + 0x08U)
#define STM32F411_DMA_SM0AR(base, s) (STM32F411_DMA_STREAM((base), (s)) + 0x0CU)
#define STM32F411_DMA_SM1AR(base, s) (STM32F411_DMA_STREAM((base), (s)) + 0x10U)
#define STM32F411_DMA_SFCR(base, s)  (STM32F411_DMA_STREAM((base), (s)) + 0x14U)

#define STM32F411_DMA_SCR_EN         STM32F411_BIT(0)
#define STM32F411_DMA_SCR_DMEIE      STM32F411_BIT(1)
#define STM32F411_DMA_SCR_TEIE       STM32F411_BIT(2)
#define STM32F411_DMA_SCR_HTIE       STM32F411_BIT(3)
#define STM32F411_DMA_SCR_TCIE       STM32F411_BIT(4)
#define STM32F411_DMA_SCR_PFCTRL     STM32F411_BIT(5)
#define STM32F411_DMA_SCR_DIR_SHIFT  6
#define STM32F411_DMA_SCR_DIR_P2M    (0U << STM32F411_DMA_SCR_DIR_SHIFT)
#define STM32F411_DMA_SCR_DIR_M2P    (1U << STM32F411_DMA_SCR_DIR_SHIFT)
#define STM32F411_DMA_SCR_DIR_M2M    (2U << STM32F411_DMA_SCR_DIR_SHIFT)
#define STM32F411_DMA_SCR_CIRC       STM32F411_BIT(8)
#define STM32F411_DMA_SCR_PINC       STM32F411_BIT(9)
#define STM32F411_DMA_SCR_MINC       STM32F411_BIT(10)
#define STM32F411_DMA_SCR_PSIZE_SHIFT 11
#define STM32F411_DMA_SCR_MSIZE_SHIFT 13
#define STM32F411_DMA_SCR_SIZE_BYTE  0U
#define STM32F411_DMA_SCR_SIZE_HALF  1U
#define STM32F411_DMA_SCR_SIZE_WORD  2U
#define STM32F411_DMA_SCR_PINCOS     STM32F411_BIT(15)
#define STM32F411_DMA_SCR_PL_SHIFT   16
#define STM32F411_DMA_SCR_PL_LOW     (0U << STM32F411_DMA_SCR_PL_SHIFT)
#define STM32F411_DMA_SCR_PL_MEDIUM  (1U << STM32F411_DMA_SCR_PL_SHIFT)
#define STM32F411_DMA_SCR_PL_HIGH    (2U << STM32F411_DMA_SCR_PL_SHIFT)
#define STM32F411_DMA_SCR_PL_VHIGH   (3U << STM32F411_DMA_SCR_PL_SHIFT)
#define STM32F411_DMA_SCR_DBM        STM32F411_BIT(18)
#define STM32F411_DMA_SCR_CT         STM32F411_BIT(19)
#define STM32F411_DMA_SCR_PBURST_SHIFT 21
#define STM32F411_DMA_SCR_MBURST_SHIFT 23
#define STM32F411_DMA_SCR_CHSEL_SHIFT 25
#define STM32F411_DMA_SCR_CHSEL(ch)  (((uint32_t)(ch) & 0x07U) << STM32F411_DMA_SCR_CHSEL_SHIFT)

#define STM32F411_DMA_SFCR_FTH_MASK  0x03U
#define STM32F411_DMA_SFCR_FTH_1_4   0U
#define STM32F411_DMA_SFCR_FTH_1_2   1U
#define STM32F411_DMA_SFCR_FTH_3_4   2U
#define STM32F411_DMA_SFCR_FTH_FULL  3U
#define STM32F411_DMA_SFCR_DMDIS     STM32F411_BIT(2)
#define STM32F411_DMA_SFCR_FEIE      STM32F411_BIT(7)

/*---------------------------------------------------------------------------*/
/* WATCHDOGS                                                                 */
/*---------------------------------------------------------------------------*/

#define STM32F411_IWDG_KR           (STM32F411_IWDG_BASE + 0x00U)
#define STM32F411_IWDG_PR           (STM32F411_IWDG_BASE + 0x04U)
#define STM32F411_IWDG_RLR          (STM32F411_IWDG_BASE + 0x08U)
#define STM32F411_IWDG_SR           (STM32F411_IWDG_BASE + 0x0CU)

#define STM32F411_IWDG_KR_UNLOCK    0x5555U
#define STM32F411_IWDG_KR_RELOAD    0xAAAAU
#define STM32F411_IWDG_KR_ENABLE    0xCCCCU
#define STM32F411_IWDG_SR_PVU       STM32F411_BIT(0)
#define STM32F411_IWDG_SR_RVU       STM32F411_BIT(1)

#define STM32F411_WWDG_CR           (STM32F411_WWDG_BASE + 0x00U)
#define STM32F411_WWDG_CFR          (STM32F411_WWDG_BASE + 0x04U)
#define STM32F411_WWDG_SR           (STM32F411_WWDG_BASE + 0x08U)

#define STM32F411_WWDG_CR_T_MASK    0x7FU
#define STM32F411_WWDG_CR_WDGA      STM32F411_BIT(7)
#define STM32F411_WWDG_CFR_W_MASK   0x7FU
#define STM32F411_WWDG_CFR_WDGTB_SHIFT 7
#define STM32F411_WWDG_CFR_EWI      STM32F411_BIT(9)
#define STM32F411_WWDG_SR_EWIF      STM32F411_BIT(0)

/*---------------------------------------------------------------------------*/
/* PWR                                                                       */
/*---------------------------------------------------------------------------*/

#define STM32F411_PWR_CR            (STM32F411_PWR_BASE + 0x00U)
#define STM32F411_PWR_CSR           (STM32F411_PWR_BASE + 0x04U)

#define STM32F411_PWR_CR_LPDS       STM32F411_BIT(0)
#define STM32F411_PWR_CR_PDDS       STM32F411_BIT(1)
#define STM32F411_PWR_CR_CWUF       STM32F411_BIT(2)
#define STM32F411_PWR_CR_CSBF       STM32F411_BIT(3)
#define STM32F411_PWR_CR_PVDE       STM32F411_BIT(4)
#define STM32F411_PWR_CR_PLS_SHIFT  5
#define STM32F411_PWR_CR_DBP        STM32F411_BIT(8)
#define STM32F411_PWR_CR_FPDS       STM32F411_BIT(9)
#define STM32F411_PWR_CR_VOS_SHIFT  14
#define STM32F411_PWR_CR_VOS_MASK   (0x03U << STM32F411_PWR_CR_VOS_SHIFT)

#define STM32F411_PWR_CSR_WUF       STM32F411_BIT(0)
#define STM32F411_PWR_CSR_SBF       STM32F411_BIT(1)
#define STM32F411_PWR_CSR_PVDO      STM32F411_BIT(2)
#define STM32F411_PWR_CSR_BRR       STM32F411_BIT(3)
#define STM32F411_PWR_CSR_EWUP      STM32F411_BIT(8)
#define STM32F411_PWR_CSR_BRE       STM32F411_BIT(9)
#define STM32F411_PWR_CSR_VOSRDY    STM32F411_BIT(14)

/*---------------------------------------------------------------------------*/
/* SysTick, NVIC, SCB                                                        */
/*---------------------------------------------------------------------------*/

#define STM32F411_SYST_CSR          (STM32F411_SYST_BASE + 0x00U)
#define STM32F411_SYST_RVR          (STM32F411_SYST_BASE + 0x04U)
#define STM32F411_SYST_CVR          (STM32F411_SYST_BASE + 0x08U)
#define STM32F411_SYST_CALIB        (STM32F411_SYST_BASE + 0x0CU)

#define STM32F411_SYST_CSR_ENABLE   STM32F411_BIT(0)
#define STM32F411_SYST_CSR_TICKINT  STM32F411_BIT(1)
#define STM32F411_SYST_CSR_CLKSRC_CPU STM32F411_BIT(2)
#define STM32F411_SYST_CSR_COUNTFLAG STM32F411_BIT(16)

#define STM32F411_NVIC_ISER0        (STM32F411_NVIC_BASE + 0x000U)
#define STM32F411_NVIC_ICER0        (STM32F411_NVIC_BASE + 0x080U)
#define STM32F411_NVIC_ISPR0        (STM32F411_NVIC_BASE + 0x100U)
#define STM32F411_NVIC_ICPR0        (STM32F411_NVIC_BASE + 0x180U)
#define STM32F411_NVIC_IABR0        (STM32F411_NVIC_BASE + 0x200U)
#define STM32F411_NVIC_IPR0         (STM32F411_NVIC_BASE + 0x300U)

