tikuos/tikuOS/arch/stm32f411re/tiku_stm32f411_regs.h
#define STM32F411_SCB_CPUID         (STM32F411_SCB_BASE + 0x00U)
#define STM32F411_SCB_ICSR          (STM32F411_SCB_BASE + 0x04U)
#define STM32F411_SCB_VTOR          (STM32F411_SCB_BASE + 0x08U)
#define STM32F411_SCB_AIRCR         (STM32F411_SCB_BASE + 0x0CU)
#define STM32F411_SCB_SCR           (STM32F411_SCB_BASE + 0x10U)
#define STM32F411_SCB_CCR           (STM32F411_SCB_BASE + 0x14U)
#define STM32F411_SCB_SHPR1         (STM32F411_SCB_BASE + 0x18U)
#define STM32F411_SCB_SHPR2         (STM32F411_SCB_BASE + 0x1CU)
#define STM32F411_SCB_SHPR3         (STM32F411_SCB_BASE + 0x20U)
#define STM32F411_SCB_SHCSR         (STM32F411_SCB_BASE + 0x24U)
#define STM32F411_SCB_CFSR          (STM32F411_SCB_BASE + 0x28U)
#define STM32F411_SCB_HFSR          (STM32F411_SCB_BASE + 0x2CU)
#define STM32F411_SCB_MMFAR         (STM32F411_SCB_BASE + 0x34U)
#define STM32F411_SCB_BFAR          (STM32F411_SCB_BASE + 0x38U)
#define STM32F411_SCB_CPACR         (STM32F411_SCB_BASE + 0x88U)

#define STM32F411_SCB_AIRCR_VECTKEY      (0x05FAUL << 16)
#define STM32F411_SCB_AIRCR_SYSRESETREQ  STM32F411_BIT(2)
#define STM32F411_SCB_SCR_SLEEPDEEP      STM32F411_BIT(2)
#define STM32F411_SCB_CCR_UNALIGN_TRP    STM32F411_BIT(3)
#define STM32F411_SCB_CCR_DIV_0_TRP      STM32F411_BIT(4)
#define STM32F411_SCB_SHCSR_MEMFAULTENA  STM32F411_BIT(16)
#define STM32F411_SCB_SHCSR_BUSFAULTENA  STM32F411_BIT(17)
#define STM32F411_SCB_SHCSR_USGFAULTENA  STM32F411_BIT(18)

#define STM32F411_SCB_MMFSR_IACCVIOL     STM32F411_BIT(0)
#define STM32F411_SCB_MMFSR_DACCVIOL     STM32F411_BIT(1)
#define STM32F411_SCB_MMFSR_MUNSTKERR    STM32F411_BIT(3)
#define STM32F411_SCB_MMFSR_MSTKERR      STM32F411_BIT(4)
#define STM32F411_SCB_MMFSR_MMARVALID    STM32F411_BIT(7)
#define STM32F411_SCB_BFSR_IBUSERR       STM32F411_BIT(8)
#define STM32F411_SCB_BFSR_PRECISERR     STM32F411_BIT(9)
#define STM32F411_SCB_BFSR_IMPRECISERR   STM32F411_BIT(10)
#define STM32F411_SCB_BFSR_UNSTKERR      STM32F411_BIT(11)
#define STM32F411_SCB_BFSR_STKERR        STM32F411_BIT(12)
#define STM32F411_SCB_BFSR_BFARVALID     STM32F411_BIT(15)
#define STM32F411_SCB_UFSR_UNDEFINSTR    STM32F411_BIT(16)
#define STM32F411_SCB_UFSR_INVSTATE      STM32F411_BIT(17)
#define STM32F411_SCB_UFSR_INVPC         STM32F411_BIT(18)
#define STM32F411_SCB_UFSR_NOCP          STM32F411_BIT(19)
#define STM32F411_SCB_UFSR_UNALIGNED     STM32F411_BIT(24)
#define STM32F411_SCB_UFSR_DIVBYZERO     STM32F411_BIT(25)

#define STM32F411_SCB_CPACR_CP10_FULL    (3UL << 20)
#define STM32F411_SCB_CPACR_CP11_FULL    (3UL << 22)

static inline void stm32f411_nvic_enable(uint32_t irq) {
    _STM32F411_REG(STM32F411_NVIC_ISER0 + ((irq / 32U) * 4U))
        = STM32F411_BIT(irq & 31U);
}

static inline void stm32f411_nvic_disable(uint32_t irq) {
    _STM32F411_REG(STM32F411_NVIC_ICER0 + ((irq / 32U) * 4U))
        = STM32F411_BIT(irq & 31U);
}

static inline void stm32f411_nvic_clear_pending(uint32_t irq) {
    _STM32F411_REG(STM32F411_NVIC_ICPR0 + ((irq / 32U) * 4U))
        = STM32F411_BIT(irq & 31U);
}

/*---------------------------------------------------------------------------*/
/* MPU - ARMv7-M                                                             */
/*---------------------------------------------------------------------------*/

#define STM32F411_MPU_TYPE          (STM32F411_MPU_BASE + 0x00U)
#define STM32F411_MPU_CTRL          (STM32F411_MPU_BASE + 0x04U)
#define STM32F411_MPU_RNR           (STM32F411_MPU_BASE + 0x08U)
#define STM32F411_MPU_RBAR          (STM32F411_MPU_BASE + 0x0CU)
#define STM32F411_MPU_RASR          (STM32F411_MPU_BASE + 0x10U)

#define STM32F411_MPU_CTRL_ENABLE   STM32F411_BIT(0)
#define STM32F411_MPU_CTRL_HFNMIENA STM32F411_BIT(1)
#define STM32F411_MPU_CTRL_PRIVDEFENA STM32F411_BIT(2)

#define STM32F411_MPU_RBAR_REGION_SHIFT 0
#define STM32F411_MPU_RBAR_VALID    STM32F411_BIT(4)
#define STM32F411_MPU_RBAR_ADDR_MASK 0xFFFFFFE0UL

#define STM32F411_MPU_RASR_ENABLE   STM32F411_BIT(0)
#define STM32F411_MPU_RASR_SIZE_SHIFT 1
#define STM32F411_MPU_RASR_SIZE(sz_log2) ((((uint32_t)(sz_log2) - 1U) & 0x1FU) << STM32F411_MPU_RASR_SIZE_SHIFT)
#define STM32F411_MPU_RASR_SRD_SHIFT 8
#define STM32F411_MPU_RASR_B        STM32F411_BIT(16)
#define STM32F411_MPU_RASR_C        STM32F411_BIT(17)
#define STM32F411_MPU_RASR_S        STM32F411_BIT(18)
#define STM32F411_MPU_RASR_TEX_SHIFT 19
#define STM32F411_MPU_RASR_AP_SHIFT 24
#define STM32F411_MPU_RASR_AP_NO_ACCESS   (0U << STM32F411_MPU_RASR_AP_SHIFT)
#define STM32F411_MPU_RASR_AP_PRIV_RW     (1U << STM32F411_MPU_RASR_AP_SHIFT)
#define STM32F411_MPU_RASR_AP_FULL_ACCESS (3U << STM32F411_MPU_RASR_AP_SHIFT)
#define STM32F411_MPU_RASR_AP_PRIV_RO     (5U << STM32F411_MPU_RASR_AP_SHIFT)
#define STM32F411_MPU_RASR_AP_RO          (6U << STM32F411_MPU_RASR_AP_SHIFT)
#define STM32F411_MPU_RASR_XN       STM32F411_BIT(28)

/*---------------------------------------------------------------------------*/
/* DEBUG MCU                                                                 */
/*---------------------------------------------------------------------------*/

#define STM32F411_DBGMCU_IDCODE     (STM32F411_DBGMCU_BASE + 0x00U)
#define STM32F411_DBGMCU_CR         (STM32F411_DBGMCU_BASE + 0x04U)
#define STM32F411_DBGMCU_APB1_FZ    (STM32F411_DBGMCU_BASE + 0x08U)
#define STM32F411_DBGMCU_APB2_FZ    (STM32F411_DBGMCU_BASE + 0x0CU)

#define STM32F411_DBGMCU_APB1_FZ_DBG_TIM2_STOP  STM32F411_BIT(0)
#define STM32F411_DBGMCU_APB1_FZ_DBG_TIM3_STOP  STM32F411_BIT(1)
#define STM32F411_DBGMCU_APB1_FZ_DBG_TIM4_STOP  STM32F411_BIT(2)
#define STM32F411_DBGMCU_APB1_FZ_DBG_TIM5_STOP  STM32F411_BIT(3)
#define STM32F411_DBGMCU_APB1_FZ_DBG_WWDG_STOP  STM32F411_BIT(11)
#define STM32F411_DBGMCU_APB1_FZ_DBG_IWDG_STOP  STM32F411_BIT(12)
#define STM32F411_DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT STM32F411_BIT(21)
#define STM32F411_DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT STM32F411_BIT(22)
#define STM32F411_DBGMCU_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT STM32F411_BIT(23)
#define STM32F411_DBGMCU_APB2_FZ_DBG_TIM1_STOP  STM32F411_BIT(0)
#define STM32F411_DBGMCU_APB2_FZ_DBG_TIM9_STOP  STM32F411_BIT(16)
#define STM32F411_DBGMCU_APB2_FZ_DBG_TIM10_STOP STM32F411_BIT(17)
#define STM32F411_DBGMCU_APB2_FZ_DBG_TIM11_STOP STM32F411_BIT(18)

